Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  CCU Clock Control Register 2 */
typedef struct _Ifx_SCU_CCUCON2_Bits
{
    unsigned int ASCLINFDIV : 4;              /**< \brief [3:0] ASCLIN Fast Divider Reload Value (rw) */
    unsigned int reserved_4 : 4;              /**< \brief \internal Reserved */
    unsigned int ASCLINSDIV : 4;              /**< \brief [11:8] ASCLIN Slow Divider Reload Value (rw) */
    unsigned int CLKSELASCLINS : 2;           /**< \brief [13:12] Clock Selection for ASCLINS (rw) */
    unsigned int reserved_14 : 17;            /**< \brief \internal Reserved */
    unsigned int LCK : 1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_CCUCON2_Bits;

/** \\brief  CCU Clock Control Register 6 */
typedef struct _Ifx_SCU_CCUCON6_Bits
{
    unsigned int CPU0DIV : 6;                 /**< \brief [5:0] CPU0 Divider Reload Value (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON6_Bits;

/** \\brief  CCU Clock Control Register 7 */
typedef struct _Ifx_SCU_CCUCON7_Bits
{
    unsigned int CPU1DIV : 6;                 /**< \brief [5:0] CPU1 Divider Reload Value (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON7_Bits;

/** \\brief  CCU Clock Control Register 8 */
typedef struct _Ifx_SCU_CCUCON8_Bits
{
    unsigned int CPU2DIV : 6;                 /**< \brief [5:0] CPU2 Divider Reload Value (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON8_Bits;

/** \\brief  CCU Clock Control Register 9 */
typedef struct _Ifx_SCU_CCUCON9_Bits
{
    unsigned int CPU3DIV : 6;                 /**< \brief [5:0] CPU3 Divider Reload Value (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_CCUCON9_Bits;

/** \\brief  Chip Identification Register */
typedef struct _Ifx_SCU_CHIPID_Bits
{
    unsigned int CHREV : 6;                   /**< \brief [5:0] Chip Revision Number (r) */
    unsigned int CHTEC : 2;                   /**< \brief [7:6] Chip Family (r) */
    unsigned int CHPK : 4;                    /**< \brief [11:8] Chip Package (rw) */
    unsigned int CHID : 4;                    /**< \brief [15:12] Chip Product (rw) */
    unsigned int EEA : 1;                     /**< \brief [16:16] Emulation or ADAS Extension Available (rh) */
    unsigned int UCODE : 7;                   /**< \brief [23:17] µCode Version (rw) */
    unsigned int FSIZE : 4;                   /**< \brief [27:24] Program Flash Size (rw) */
    unsigned int VART : 3;                    /**< \brief [30:28] Variant (rw) */
    unsigned int SEC : 1;                     /**< \brief [31:31] Security Device Available (rw) */
} Ifx_SCU_CHIPID_Bits;

/** \\brief  ENDINIT Global Control Register 0 */
typedef struct _Ifx_SCU_EICON0_Bits
{
    unsigned int Reserved : 1;                /**< \brief [0:0] Reserved Bit (r) */
    unsigned int ENDINIT : 1;                 /**< \brief [1:1] End-of-Initialization Control Bit (rwh) */
    unsigned int EPW : 14;                    /**< \brief [15:2] User-Definable ENDINIT Password Field (rwh) */
    unsigned int REL : 16;                    /**< \brief [31:16] Reload Value for the ENDINIT timer (r) */
} Ifx_SCU_EICON0_Bits;

/** \\brief  ENDINIT Global Control Register 1 */
typedef struct _Ifx_SCU_EICON1_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int IR0 : 1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR : 1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4 : 1;              /**< \brief \internal Reserved */
    unsigned int IR1 : 1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_EICON1_Bits;

/** \\brief  External Input Channel Register */
typedef struct _Ifx_SCU_EICR_Bits
{
    unsigned int reserved_0 : 4;              /**< \brief \internal Reserved */
    unsigned int EXIS0 : 3;                   /**< \brief [6:4] External Input Selection 0 (rw) */
    unsigned int reserved_7 : 1;              /**< \brief \internal Reserved */
    unsigned int FEN0 : 1;                    /**< \brief [8:8] Falling Edge Enable 0 (rw) */
    unsigned int REN0 : 1;                    /**< \brief [9:9] Rising Edge Enable 0 (rw) */
    unsigned int LDEN0 : 1;                   /**< \brief [10:10] Level Detection Enable 0 (rw) */
    unsigned int EIEN0 : 1;                   /**< \brief [11:11] External Input Enable 0 (rw) */
    unsigned int INP0 : 3;                    /**< \brief [14:12] Input Node Pointer (rw) */
    unsigned int reserved_15 : 5;             /**< \brief \internal Reserved */
    unsigned int EXIS1 : 3;                   /**< \brief [22:20] External Input Selection 1 (rw) */
    unsigned int reserved_23 : 1;             /**< \brief \internal Reserved */
    unsigned int FEN1 : 1;                    /**< \brief [24:24] Falling Edge Enable 1 (rw) */
    unsigned int REN1 : 1;                    /**< \brief [25:25] Rising Edge Enable 1 (rw) */
    unsigned int LDEN1 : 1;                   /**< \brief [26:26] Level Detection Enable 1 (rw) */
    unsigned int EIEN1 : 1;                   /**< \brief [27:27] External Input Enable 1 (rw) */
    unsigned int INP1 : 3;                    /**< \brief [30:28] Input Node Pointer (rw) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_SCU_EICR_Bits;

/** \\brief  External Input Filter Register */
typedef struct _Ifx_SCU_EIFILT_Bits
{
    unsigned int FILRQ0A : 1;                 /**< \brief [0:0] Filter Enable for REQ0A (rw) */
    unsigned int FILRQ5A : 1;                 /**< \brief [1:1] Filter Enable for REQ5A (rw) */
    unsigned int FILRQ2A : 1;                 /**< \brief [2:2] Filter Enable for REQ2A (rw) */
    unsigned int FILRQ3A : 1;                 /**< \brief [3:3] Filter Enable for REQ3A (rw) */
    unsigned int FILRQ0C : 1;                 /**< \brief [4:4] Filter Enable for REQ0C (rw) */
    unsigned int FILRQ1C : 1;                 /**< \brief [5:5] Filter Enable for REQ1C (rw) */
    unsigned int FILRQ3C : 1;                 /**< \brief [6:6] Filter Enable for REQ3C (rw) */
    unsigned int FILRQ2C : 1;                 /**< \brief [7:7] Filter Enable for REQ2C (rw) */
    unsigned int FILRQ4A : 1;                 /**< \brief [8:8] Filter Enable for REQ4A (rw) */
    unsigned int FILRQ6A : 1;                 /**< \brief [9:9] Filter Enable for REQ6A (rw) */
    unsigned int FILRQ1A : 1;                 /**< \brief [10:10] Filter Enable for REQ1A (rw) */
    unsigned int FILRQ7A : 1;                 /**< \brief [11:11] Filter Enable for REQ7A (rw) */
    unsigned int FILRQ6D : 1;                 /**< \brief [12:12] Filter Enable for REQ6D (rw) */
    unsigned int FILRQ4D : 1;                 /**< \brief [13:13] Filter Enable for REQ4D (rw) */
    unsigned int FILRQ2B : 1;                 /**< \brief [14:14] Filter Enable for REQ2B (rw) */
    unsigned int FILRQ3B : 1;                 /**< \brief [15:15] Filter Enable for REQ3B (rw) */
    unsigned int FILRQ7C : 1;                 /**< \brief [16:16] Filter Enable for REQ7C (rw) */
    unsigned int reserved_17 : 7;             /**< \brief \internal Reserved */
    unsigned int FILTDIV : 4;                 /**< \brief [27:24] Digital Glitch Filter Clock Predivider (rw) */
    unsigned int DEPTH : 4;                   /**< \brief [31:28] Digital Glitch Filter Depth (rw) */
} Ifx_SCU_EIFILT_Bits;

