Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  External Input Flag Register */
typedef struct _Ifx_SCU_EIFR_Bits
{
    unsigned int INTF0 : 1;                   /**< \brief [0:0] E0ternal Event Flag of Channel x (rh) */
    unsigned int INTF1 : 1;                   /**< \brief [1:1] E1ternal Event Flag of Channel x (rh) */
    unsigned int INTF2 : 1;                   /**< \brief [2:2] E2ternal Event Flag of Channel x (rh) */
    unsigned int INTF3 : 1;                   /**< \brief [3:3] E3ternal Event Flag of Channel x (rh) */
    unsigned int INTF4 : 1;                   /**< \brief [4:4] E4ternal Event Flag of Channel x (rh) */
    unsigned int INTF5 : 1;                   /**< \brief [5:5] E5ternal Event Flag of Channel x (rh) */
    unsigned int INTF6 : 1;                   /**< \brief [6:6] E6ternal Event Flag of Channel x (rh) */
    unsigned int INTF7 : 1;                   /**< \brief [7:7] E7ternal Event Flag of Channel x (rh) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_SCU_EIFR_Bits;

/** \\brief  ENDINIT Timeout Counter Status Register */
typedef struct _Ifx_SCU_EISR_Bits
{
    unsigned int AE : 1;                      /**< \brief [0:0] EICON0 Access Error Status Flag (rh) */
    unsigned int OE : 1;                      /**< \brief [1:1] EI Timeout Overflow Error Status Flag (rh) */
    unsigned int IS0 : 1;                     /**< \brief [2:2] EI Timeout Input Clock Status (rh) */
    unsigned int DS : 1;                      /**< \brief [3:3] EI Timeout Enable/Disable Status Flag (rh) */
    unsigned int TO : 1;                      /**< \brief [4:4] EI Time-Out Mode Flag (rh) */
    unsigned int IS1 : 1;                     /**< \brief [5:5] EI Timeout Input Clock Status (rh) */
    unsigned int reserved_6 : 10;             /**< \brief \internal Reserved */
    unsigned int TIM : 16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_EISR_Bits;

/** \\brief  Emergency Stop Register */
typedef struct _Ifx_SCU_EMSR_Bits
{
    unsigned int POL : 1;                     /**< \brief [0:0] Input Polarity (rw) */
    unsigned int MODE : 1;                    /**< \brief [1:1] Mode Selection (rw) */
    unsigned int ENON : 1;                    /**< \brief [2:2] Enable ON (rw) */
    unsigned int PSEL : 1;                    /**< \brief [3:3] PORT Select (rw) */
    unsigned int reserved_4 : 12;             /**< \brief \internal Reserved */
    unsigned int EMSF : 1;                    /**< \brief [16:16] Emergency Stop Flag (rh) */
    unsigned int SEMSF : 1;                   /**< \brief [17:17] SMU Emergency Stop Flag (rh) */
    unsigned int reserved_18 : 6;             /**< \brief \internal Reserved */
    unsigned int EMSFM : 2;                   /**< \brief [25:24] Emergency Stop Flag Modification (w) */
    unsigned int SEMSFM : 2;                  /**< \brief [27:26] SMU Emergency Stop Flag Modification (w) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_SCU_EMSR_Bits;

/** \\brief  ESR Input Configuration Register */
typedef struct _Ifx_SCU_ESRCFG_Bits
{
    unsigned int reserved_0 : 7;              /**< \brief \internal Reserved */
    unsigned int EDCON : 2;                   /**< \brief [8:7] Edge Detection Control (rw) */
    unsigned int reserved_9 : 23;             /**< \brief \internal Reserved */
} Ifx_SCU_ESRCFG_Bits;

/** \\brief  ESR Output Configuration Register */
typedef struct _Ifx_SCU_ESROCFG_Bits
{
    unsigned int ARI : 1;                     /**< \brief [0:0] Application Reset Indicator (rh) */
    unsigned int ARC : 1;                     /**< \brief [1:1] Application Reset Indicator Clear (w) */
    unsigned int reserved_2 : 30;             /**< \brief \internal Reserved */
} Ifx_SCU_ESROCFG_Bits;

/** \\brief  External Clock Control Register */
typedef struct _Ifx_SCU_EXTCON_Bits
{
    unsigned int EN0 : 1;                     /**< \brief [0:0] External Clock Enable for EXTCLK0 (rwh) */
    unsigned int reserved_1 : 1;              /**< \brief \internal Reserved */
    unsigned int SEL0 : 4;                    /**< \brief [5:2] External Clock Select for EXTCLK0 (rwh) */
    unsigned int reserved_6 : 10;             /**< \brief \internal Reserved */
    unsigned int EN1 : 1;                     /**< \brief [16:16] External Clock Enable for EXTCLK1 (rwh) */
    unsigned int NSEL : 1;                    /**< \brief [17:17] Negation Selection (rwh) */
    unsigned int SEL1 : 4;                    /**< \brief [21:18] External Clock Select for EXTCLK1 (rwh) */
    unsigned int reserved_22 : 2;             /**< \brief \internal Reserved */
    unsigned int DIV1 : 8;                    /**< \brief [31:24] External Clock Divider for EXTCLK1 (rw) */
} Ifx_SCU_EXTCON_Bits;

/** \\brief  Fractional Divider Register */
typedef struct _Ifx_SCU_FDR_Bits
{
    unsigned int STEP : 10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10 : 4;             /**< \brief \internal Reserved */
    unsigned int DM : 2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT : 10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26 : 5;             /**< \brief \internal Reserved */
    unsigned int DISCLK : 1;                  /**< \brief [31:31] Disable Clock (rwh) */
} Ifx_SCU_FDR_Bits;

/** \\brief  Flag Modification Register */
typedef struct _Ifx_SCU_FMR_Bits
{
    unsigned int FS0 : 1;                     /**< \brief [0:0] Set Flag INTF0 for Channel x (w) */
    unsigned int FS1 : 1;                     /**< \brief [1:1] Set Flag INTF1 for Channel x (w) */
    unsigned int FS2 : 1;                     /**< \brief [2:2] Set Flag INTF2 for Channel x (w) */
    unsigned int FS3 : 1;                     /**< \brief [3:3] Set Flag INTF3 for Channel x (w) */
    unsigned int FS4 : 1;                     /**< \brief [4:4] Set Flag INTF4 for Channel x (w) */
    unsigned int FS5 : 1;                     /**< \brief [5:5] Set Flag INTF5 for Channel x (w) */
    unsigned int FS6 : 1;                     /**< \brief [6:6] Set Flag INTF6 for Channel x (w) */
    unsigned int FS7 : 1;                     /**< \brief [7:7] Set Flag INTF7 for Channel x (w) */
    unsigned int reserved_8 : 8;              /**< \brief \internal Reserved */
    unsigned int FC0 : 1;                     /**< \brief [16:16] Clear Flag INTF0 for Channel x (w) */
    unsigned int FC1 : 1;                     /**< \brief [17:17] Clear Flag INTF1 for Channel x (w) */
    unsigned int FC2 : 1;                     /**< \brief [18:18] Clear Flag INTF2 for Channel x (w) */
    unsigned int FC3 : 1;                     /**< \brief [19:19] Clear Flag INTF3 for Channel x (w) */
    unsigned int FC4 : 1;                     /**< \brief [20:20] Clear Flag INTF4 for Channel x (w) */
    unsigned int FC5 : 1;                     /**< \brief [21:21] Clear Flag INTF5 for Channel x (w) */
    unsigned int FC6 : 1;                     /**< \brief [22:22] Clear Flag INTF6 for Channel x (w) */
    unsigned int FC7 : 1;                     /**< \brief [23:23] Clear Flag INTF7 for Channel x (w) */
    unsigned int reserved_24 : 8;             /**< \brief \internal Reserved */
} Ifx_SCU_FMR_Bits;

/** \\brief  Identification Register */
typedef struct _Ifx_SCU_ID_Bits
{
    unsigned int MODREV : 8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE : 8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER : 16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_SCU_ID_Bits;

