Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Flag Gating Register */
typedef struct _Ifx_SCU_IGCR_Bits
{
    unsigned int IPEN00 : 1;                  /**< \brief [0:0] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN01 : 1;                  /**< \brief [1:1] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN02 : 1;                  /**< \brief [2:2] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN03 : 1;                  /**< \brief [3:3] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN04 : 1;                  /**< \brief [4:4] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN05 : 1;                  /**< \brief [5:5] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN06 : 1;                  /**< \brief [6:6] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN07 : 1;                  /**< \brief [7:7] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int reserved_8 : 5;              /**< \brief \internal Reserved */
    unsigned int GEEN0 : 1;                   /**< \brief [13:13] Generate Event Enable 0 (rw) */
    unsigned int IGP0 : 2;                    /**< \brief [15:14] Interrupt Gating Pattern 0 (rw) */
    unsigned int IPEN10 : 1;                  /**< \brief [16:16] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN11 : 1;                  /**< \brief [17:17] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN12 : 1;                  /**< \brief [18:18] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN13 : 1;                  /**< \brief [19:19] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN14 : 1;                  /**< \brief [20:20] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN15 : 1;                  /**< \brief [21:21] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN16 : 1;                  /**< \brief [22:22] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN17 : 1;                  /**< \brief [23:23] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int reserved_24 : 5;             /**< \brief \internal Reserved */
    unsigned int GEEN1 : 1;                   /**< \brief [29:29] Generate Event Enable 1 (rw) */
    unsigned int IGP1 : 2;                    /**< \brief [31:30] Interrupt Gating Pattern 1 (rw) */
} Ifx_SCU_IGCR_Bits;

/** \\brief  ESR Input Register */
typedef struct _Ifx_SCU_IN_Bits
{
    unsigned int P0 : 1;                      /**< \brief [0:0] Input Bit 0 (rh) */
    unsigned int P1 : 1;                      /**< \brief [1:1] Input Bit 1 (rh) */
    unsigned int reserved_2 : 30;             /**< \brief \internal Reserved */
} Ifx_SCU_IN_Bits;

/** \\brief  Input/Output Control Register */
typedef struct _Ifx_SCU_IOCR_Bits
{
    unsigned int reserved_0 : 4;              /**< \brief \internal Reserved */
    unsigned int PC0 : 4;                     /**< \brief [7:4] Control for ESR Pin x (rw) */
    unsigned int reserved_8 : 4;              /**< \brief \internal Reserved */
    unsigned int PC1 : 4;                     /**< \brief [15:12] Control for ESR Pin x (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_IOCR_Bits;

/** \\brief  Logic BIST Control 0 Register */
typedef struct _Ifx_SCU_LBISTCTRL0_Bits
{
    unsigned int LBISTREQ : 1;                /**< \brief [0:0] LBIST Request (w) */
    unsigned int LBISTRES : 1;                /**< \brief [1:1] LBIST-Restart (w) */
    unsigned int PATTERNS : 18;               /**< \brief [19:2] LBIST Pattern Number (rw) */
    unsigned int reserved_20 : 8;             /**< \brief \internal Reserved */
    unsigned int LBISTDONE : 1;               /**< \brief [28:28] LBIST Execution Indicator (rh) */
    unsigned int reserved_29 : 3;             /**< \brief \internal Reserved */
} Ifx_SCU_LBISTCTRL0_Bits;

/** \\brief  Logic BIST Control 1 Register */
typedef struct _Ifx_SCU_LBISTCTRL1_Bits
{
    unsigned int SEED : 19;                   /**< \brief [18:0] LBIST Seed (rw) */
    unsigned int reserved_19 : 5;             /**< \brief \internal Reserved */
    unsigned int SPLITSH : 3;                 /**< \brief [26:24] LBIST Split-Shift Selection (rw) */
    unsigned int BODY : 1;                    /**< \brief [27:27] Body Application Indicator (rw) */
    unsigned int LBISTFREQU : 4;              /**< \brief [31:28] LBIST Frequency Selection (rw) */
} Ifx_SCU_LBISTCTRL1_Bits;

/** \\brief  Logic BIST Control 2 Register */
typedef struct _Ifx_SCU_LBISTCTRL2_Bits
{
    unsigned int LENGTH : 12;                 /**< \brief [11:0] LBIST Maximum Scan-Chain Length (rwh) */
    unsigned int reserved_12 : 20;            /**< \brief \internal Reserved */
} Ifx_SCU_LBISTCTRL2_Bits;

/** \\brief  Logic BIST Control 3 Register */
typedef struct _Ifx_SCU_LBISTCTRL3_Bits
{
    unsigned int SIGNATURE : 32;              /**< \brief [31:0] LBIST Signature (rh) */
} Ifx_SCU_LBISTCTRL3_Bits;

/** \\brief  LCL CPU0 Control Register */
typedef struct _Ifx_SCU_LCLCON0_Bits
{
    unsigned int LS2 : 1;                     /**< \brief [0:0] Lockstep Mode Status (rh) */
    unsigned int reserved_1 : 14;             /**< \brief \internal Reserved */
    unsigned int LSEN2 : 1;                   /**< \brief [15:15] Lockstep Enable (rw) */
    unsigned int LS0 : 1;                     /**< \brief [16:16] Lockstep Mode Status (rh) */
    unsigned int reserved_17 : 14;            /**< \brief \internal Reserved */
    unsigned int LSEN0 : 1;                   /**< \brief [31:31] Lockstep Enable (rw) */
} Ifx_SCU_LCLCON0_Bits;

/** \\brief  LCL CPU1 Control Register */
typedef struct _Ifx_SCU_LCLCON1_Bits
{
    unsigned int LS3 : 1;                     /**< \brief [0:0] Lockstep Mode Status (rh) */
    unsigned int reserved_1 : 14;             /**< \brief \internal Reserved */
    unsigned int LSEN3 : 1;                   /**< \brief [15:15] Lockstep Enable (rw) */
    unsigned int LS1 : 1;                     /**< \brief [16:16] Lockstep Mode Status (rh) */
    unsigned int reserved_17 : 14;            /**< \brief \internal Reserved */
    unsigned int LSEN1 : 1;                   /**< \brief [31:31] Lockstep Enable (rw) */
} Ifx_SCU_LCLCON1_Bits;

/** \\brief  LCL Test Register */
typedef struct _Ifx_SCU_LCLTEST_Bits
{
    unsigned int LCLT0 : 1;                   /**< \brief [0:0] LCL0 Lockstep Test (w) */
    unsigned int LCLT1 : 1;                   /**< \brief [1:1] LCL1 Lockstep Test (w) */
    unsigned int LCLT2 : 1;                   /**< \brief [2:2] LCL2 Lockstep Test (w) */
    unsigned int LCLT3 : 1;                   /**< \brief [3:3] LCL3 Lockstep Test (w) */
    unsigned int reserved_4 : 28;             /**< \brief \internal Reserved */
} Ifx_SCU_LCLTEST_Bits;

