Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Manufacturer Identification Register */
typedef struct _Ifx_SCU_MANID_Bits
{
    unsigned int DEPT : 5;                    /**< \brief [4:0] Department Identification Number (r) */
    unsigned int MANUF : 11;                  /**< \brief [15:5] Manufacturer Identification Number (r) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_MANID_Bits;

/** \\brief  Modulation Trim 1 Configuration Register */
typedef struct _Ifx_SCU_MODTRIMCON1_Bits
{
    unsigned int XCORR_TOL : 8;               /**< \brief [7:0] XCORR_TOL Trim Value (rw) */
    unsigned int DELTA_RND_GAIN : 8;          /**< \brief [15:8] DELTA_RND_GAIN Trim Value (rw) */
    unsigned int XCORR_AVG_SEL : 2;           /**< \brief [17:16] XCORR_AVG Selection (rw) */
    unsigned int XCORR_SEL_DELAY : 2;         /**< \brief [19:18] XCORR_SEL Delay (rw) */
    unsigned int reserved_20 : 4;             /**< \brief \internal Reserved */
    unsigned int SYSEMCDELAY : 2;             /**< \brief [25:24] System PLL EMC delay enable (rw) */
    unsigned int PEREMCDELAY : 2;             /**< \brief [27:26] Peripheral PLL EMC delay enable (rw) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_SCU_MODTRIMCON1_Bits;

/** \\brief  ESR Output Modification Register */
typedef struct _Ifx_SCU_OMR_Bits
{
    unsigned int PS0 : 1;                     /**< \brief [0:0] ESR0 Pin Set Bit x (w) */
    unsigned int PS1 : 1;                     /**< \brief [1:1] ESR1 Pin Set Bit x (w) */
    unsigned int reserved_2 : 14;             /**< \brief \internal Reserved */
    unsigned int PCL0 : 1;                    /**< \brief [16:16] ESR0 Pin Clear Bit x (w) */
    unsigned int PCL1 : 1;                    /**< \brief [17:17] ESR1 Pin Clear Bit x (w) */
    unsigned int reserved_18 : 14;            /**< \brief \internal Reserved */
} Ifx_SCU_OMR_Bits;

/** \\brief  OSC Control Register */
typedef struct _Ifx_SCU_OSCCON_Bits
{
    unsigned int reserved_0 : 1;              /**< \brief \internal Reserved */
    unsigned int PLLLV : 1;                   /**< \brief [1:1] Oscillator for PLL Valid Low Status Bit (rh) */
    unsigned int OSCRES : 1;                  /**< \brief [2:2] Oscillator Watchdog Reset (w) */
    unsigned int GAINSEL : 2;                 /**< \brief [4:3] Oscillator Gain Selection (rw) */
    unsigned int MODE : 2;                    /**< \brief [6:5] Oscillator Mode (rw) */
    unsigned int SHBY : 1;                    /**< \brief [7:7] Shaper Bypass (rw) */
    unsigned int PLLHV : 1;                   /**< \brief [8:8] Oscillator for PLL Valid High Status Bit (rh) */
    unsigned int reserved_9 : 7;              /**< \brief \internal Reserved */
    unsigned int OSCVAL : 5;                  /**< \brief [20:16] OSC Frequency Value (rw) */
    unsigned int reserved_21 : 2;             /**< \brief \internal Reserved */
    unsigned int APREN : 1;                   /**< \brief [23:23] Amplitude Regulation Enable (rw) */
    unsigned int CAP0EN : 1;                  /**< \brief [24:24] Capacitance 0 Enable (rw) */
    unsigned int CAP1EN : 1;                  /**< \brief [25:25] Capacitance 1 Enable (rw) */
    unsigned int CAP2EN : 1;                  /**< \brief [26:26] Capacitance 2 Enable (rw) */
    unsigned int CAP3EN : 1;                  /**< \brief [27:27] Capacitance 3 Enable (rw) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_SCU_OSCCON_Bits;

/** \\brief  ESR Output Register */
typedef struct _Ifx_SCU_OUT_Bits
{
    unsigned int P0 : 1;                      /**< \brief [0:0] Output Bit 0 (rwh) */
    unsigned int P1 : 1;                      /**< \brief [1:1] Output Bit 1 (rwh) */
    unsigned int reserved_2 : 30;             /**< \brief \internal Reserved */
} Ifx_SCU_OUT_Bits;

/** \\brief  Overlay Control Register */
typedef struct _Ifx_SCU_OVCCON_Bits
{
    unsigned int CSEL0 : 1;                   /**< \brief [0:0] CPU Select 0 (w) */
    unsigned int CSEL1 : 1;                   /**< \brief [1:1] CPU Select 1 (If product has CPU1) (w) */
    unsigned int CSEL2 : 1;                   /**< \brief [2:2] CPU Select 2 (If product has CPU2) (w) */
    unsigned int CSEL3 : 1;                   /**< \brief [3:3] CPU Select 3 (If product has CPU3) (w) */
    unsigned int CSEL4 : 1;                   /**< \brief [4:4] CPU Select 4 (If product has CPU4) (w) */
    unsigned int CSEL5 : 1;                   /**< \brief [5:5] CPU Select 3 (If product has CPU3) (w) */
    unsigned int reserved_6 : 10;             /**< \brief \internal Reserved */
    unsigned int OVSTRT : 1;                  /**< \brief [16:16] Overlay Start (w) */
    unsigned int OVSTP : 1;                   /**< \brief [17:17] Overlay Stop (w) */
    unsigned int DCINVAL : 1;                 /**< \brief [18:18] Data Cache Invalidate (w) */
    unsigned int reserved_19 : 5;             /**< \brief \internal Reserved */
    unsigned int OVCONF : 1;                  /**< \brief [24:24] Overlay Configured (rw) */
    unsigned int POVCONF : 1;                 /**< \brief [25:25] Write Protection for OVCONF (w) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_SCU_OVCCON_Bits;

/** \\brief  Overlay Enable Register */
typedef struct _Ifx_SCU_OVCENABLE_Bits
{
    unsigned int OVEN0 : 1;                   /**< \brief [0:0] Overlay Enable 0 (rw) */
    unsigned int OVEN1 : 1;                   /**< \brief [1:1] Overlay Enable 1 (If product has CPU1) (rw) */
    unsigned int OVEN2 : 1;                   /**< \brief [2:2] Overlay Enable 2 (If product has CPU2) (rw) */
    unsigned int OVEN3 : 1;                   /**< \brief [3:3] Overlay Enable 3 (If product has CPU3) (rw) */
    unsigned int OVEN4 : 1;                   /**< \brief [4:4] Overlay Enable 4 (If product has CPU4) (rw) */
    unsigned int OVEN5 : 1;                   /**< \brief [5:5] Overlay Enable 5 (If product has CPU5) (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_OVCENABLE_Bits;

/** \\brief  Pad Disable Control Register */
typedef struct _Ifx_SCU_PDISC_Bits
{
    unsigned int PDIS0 : 1;                   /**< \brief [0:0] Pad Disable for ESR Pin 0 (rw) */
    unsigned int PDIS1 : 1;                   /**< \brief [1:1] Pad Disable for ESR Pin 1 (rw) */
    unsigned int reserved_2 : 30;             /**< \brief \internal Reserved */
} Ifx_SCU_PDISC_Bits;

