Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  ESR Pad Driver Mode Register */
typedef struct _Ifx_SCU_PDR_Bits
{
    unsigned int PD0 : 3;                     /**< \brief [2:0] Pad Driver Mode for ESR Pins 0 and 1 (rw) */
    unsigned int PL0 : 1;                     /**< \brief [3:3] Pad Level Selection for ESR Pins 0 and 1 (rw) */
    unsigned int PD1 : 3;                     /**< \brief [6:4] Pad Driver Mode for ESR Pins 0 and 1 (rw) */
    unsigned int PL1 : 1;                     /**< \brief [7:7] Pad Level Selection for ESR Pins 0 and 1 (rw) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_SCU_PDR_Bits;

/** \\brief  Pattern Detection Result Register */
typedef struct _Ifx_SCU_PDRR_Bits
{
    unsigned int PDR0 : 1;                    /**< \brief [0:0] Pattern Detection Result of Channel 0 (rh) */
    unsigned int PDR1 : 1;                    /**< \brief [1:1] Pattern Detection Result of Channel 1 (rh) */
    unsigned int PDR2 : 1;                    /**< \brief [2:2] Pattern Detection Result of Channel 2 (rh) */
    unsigned int PDR3 : 1;                    /**< \brief [3:3] Pattern Detection Result of Channel 3 (rh) */
    unsigned int PDR4 : 1;                    /**< \brief [4:4] Pattern Detection Result of Channel 4 (rh) */
    unsigned int PDR5 : 1;                    /**< \brief [5:5] Pattern Detection Result of Channel 5 (rh) */
    unsigned int PDR6 : 1;                    /**< \brief [6:6] Pattern Detection Result of Channel 6 (rh) */
    unsigned int PDR7 : 1;                    /**< \brief [7:7] Pattern Detection Result of Channel 7 (rh) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_SCU_PDRR_Bits;

/** \\brief  Peripheral PLL Configuration 0 Register */
typedef struct _Ifx_SCU_PERPLLCON0_Bits
{
    unsigned int DIVBY : 1;                   /**< \brief [0:0] Divider Bypass (rw) */
    unsigned int reserved_1 : 8;              /**< \brief \internal Reserved */
    unsigned int NDIV : 7;                    /**< \brief [15:9] N-Divider Value (rw) */
    unsigned int PLLPWD : 1;                  /**< \brief [16:16] Peripheral PLL Power Saving Mode (rw) */
    unsigned int reserved_17 : 1;             /**< \brief \internal Reserved */
    unsigned int RESLD : 1;                   /**< \brief [18:18] Restart DCO Lock Detection (w) */
    unsigned int reserved_19 : 5;             /**< \brief \internal Reserved */
    unsigned int PDIV : 3;                    /**< \brief [26:24] P-Divider Value (rw) */
    unsigned int reserved_27 : 5;             /**< \brief \internal Reserved */
} Ifx_SCU_PERPLLCON0_Bits;

/** \\brief  Peripheral PLL Configuration 1 Register */
typedef struct _Ifx_SCU_PERPLLCON1_Bits
{
    unsigned int K2DIV : 3;                   /**< \brief [2:0] K2-Divider Value (rw) */
    unsigned int reserved_3 : 5;              /**< \brief \internal Reserved */
    unsigned int K3DIV : 3;                   /**< \brief [10:8] K3-Divider Value (rw) */
    unsigned int reserved_11 : 21;            /**< \brief \internal Reserved */
} Ifx_SCU_PERPLLCON1_Bits;

/** \\brief  Peripheral PLL Status Register */
typedef struct _Ifx_SCU_PERPLLSTAT_Bits
{
    unsigned int reserved_0 : 1;              /**< \brief \internal Reserved */
    unsigned int PWDSTAT : 1;                 /**< \brief [1:1] Peripheral PLL Power-saving Mode Status (rh) */
    unsigned int LOCK : 1;                    /**< \brief [2:2] Peripheral PLL Lock Status (rh) */
    unsigned int reserved_3 : 1;              /**< \brief \internal Reserved */
    unsigned int K3RDY : 1;                   /**< \brief [4:4] K3 Divider Ready Status (rh) */
    unsigned int K2RDY : 1;                   /**< \brief [5:5] K2 Divider Ready Status (rh) */
    unsigned int BY : 1;                      /**< \brief [6:6] Bypass Mode Status (rh) */
    unsigned int reserved_7 : 25;             /**< \brief \internal Reserved */
} Ifx_SCU_PERPLLSTAT_Bits;

/** \\brief  Power Management Control and Status Register */
typedef struct _Ifx_SCU_PMCSR_Bits
{
    unsigned int REQSLP : 2;                  /**< \brief [1:0] Idle Mode and Sleep Mode Request (rwh) */
    unsigned int reserved_2 : 6;              /**< \brief \internal Reserved */
    unsigned int PMST : 3;                    /**< \brief [10:8] Power management Status (rh) */
    unsigned int reserved_11 : 21;            /**< \brief \internal Reserved */
} Ifx_SCU_PMCSR_Bits;

/** \\brief  Power Management Status Register 0 */
typedef struct _Ifx_SCU_PMSTAT0_Bits
{
    unsigned int CPU0 : 1;                    /**< \brief [0:0] CPU0 Status (rh) */
    unsigned int CPU1 : 1;                    /**< \brief [1:1] CPU1 Status (rh) */
    unsigned int CPU2 : 1;                    /**< \brief [2:2] CPU2 Status (rh) */
    unsigned int CPU3 : 1;                    /**< \brief [3:3] CPU3 Status (rh) */
    unsigned int CPU4 : 1;                    /**< \brief [4:4] CPU4 Status (rh) */
    unsigned int CPU5 : 1;                    /**< \brief [5:5] CPU5 Status (rh) */
    unsigned int reserved_6 : 10;             /**< \brief \internal Reserved */
    unsigned int CPU0LS : 1;                  /**< \brief [16:16] CPU0LS Status (rh) */
    unsigned int CPU1LS : 1;                  /**< \brief [17:17] CPU1LS Status (rh) */
    unsigned int CPU2LS : 1;                  /**< \brief [18:18] CPU2LS Status (rh) */
    unsigned int CPU3LS : 1;                  /**< \brief [19:19] CPU3LS Status (rh) */
    unsigned int reserved_20 : 12;            /**< \brief \internal Reserved */
} Ifx_SCU_PMSTAT0_Bits;

/** \\brief  Standby and Wake-up Control Register 1 */
typedef struct _Ifx_SCU_PMSWCR1_Bits
{
    unsigned int reserved_0 : 8;              /**< \brief \internal Reserved */
    unsigned int CPUIDLSEL : 3;               /**< \brief [10:8] CPU selection for Idle mode (rw) */
    unsigned int reserved_11 : 1;             /**< \brief \internal Reserved */
    unsigned int IRADIS : 1;                  /**< \brief [12:12] Idle-Request-Acknowledge Sequence Disable (rw) */
    unsigned int reserved_13 : 11;            /**< \brief \internal Reserved */
    unsigned int CPUSEL : 3;                  /**< \brief [26:24] CPU selection for Sleep and Standby mode (rw) */
    unsigned int STBYEVEN : 1;                /**< \brief [27:27] Standby Entry Event configuration enable (w) */
    unsigned int STBYEV : 3;                  /**< \brief [30:28] Standby Entry Event Configuration (rw) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_SCU_PMSWCR1_Bits;

/** \\brief  Power Management Transition Control and Status Register 0 */
typedef struct _Ifx_SCU_PMTRCSR0_Bits
{
    unsigned int LJTEN : 1;                   /**< \brief [0:0] Load Jump Timer Enable (rw) */
    unsigned int LJTOVEN : 1;                 /**< \brief [1:1] Load Jump Timer Overflow Enable (rw) */
    unsigned int LJTOVIEN : 1;                /**< \brief [2:2] Load Jump Timer Overflow Interrupt Enable (rw) */
    unsigned int LJTSTRT : 1;                 /**< \brief [3:3] Load Jump Timer Start (w) */
    unsigned int LJTSTP : 1;                  /**< \brief [4:4] Load Jump Timer Stop (w) */
    unsigned int LJTCLR : 1;                  /**< \brief [5:5] Load Jump Timer Clear (w) */
    unsigned int reserved_6 : 6;              /**< \brief \internal Reserved */
    unsigned int SDSTEP : 4;                  /**< \brief [15:12] Droop Voltage Step(vdroop_step_i) (rw) */
    unsigned int VDTEN : 1;                   /**< \brief [16:16] Voltage Droop Timer Enable (rw) */
    unsigned int VDTOVEN : 1;                 /**< \brief [17:17] Voltage Droop Timer Overflow Enable (rw) */
    unsigned int VDTOVIEN : 1;                /**< \brief [18:18] Voltage Droop Timer Overflow Interrupt Enable (rw) */
    unsigned int VDTSTRT : 1;                 /**< \brief [19:19] Voltage Droop Timer Start (w) */
    unsigned int VDTSTP : 1;                  /**< \brief [20:20] Voltage Droop Timer Stop (w) */
    unsigned int VDTCLR : 1;                  /**< \brief [21:21] Voltage Droop Timer Clear (w) */
    unsigned int reserved_22 : 7;             /**< \brief \internal Reserved */
    unsigned int LPSLPEN : 1;                 /**< \brief [29:29] EVRC Low Power Mode activation on a Sleep Request (rw) */
    unsigned int reserved_30 : 2;             /**< \brief \internal Reserved */
} Ifx_SCU_PMTRCSR0_Bits;

