Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Power Management Transition Control and Status Register 1 */
typedef struct _Ifx_SCU_PMTRCSR1_Bits
{
    unsigned int LJTCV : 16;                  /**< \brief [15:0] Load Jump Timer Compare Setpoint Value (rw) */
    unsigned int VDTCV : 10;                  /**< \brief [25:16] Voltage Droop Timer Compare Setpoint Value (rw) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_SCU_PMTRCSR1_Bits;

/** \\brief  Power Management Transition Control and Status Register 2 */
typedef struct _Ifx_SCU_PMTRCSR2_Bits
{
    unsigned int LDJMPREQ : 2;                /**< \brief [1:0] Load Jump Request (rwh) */
    unsigned int reserved_2 : 2;              /**< \brief \internal Reserved */
    unsigned int LJTRUN : 2;                  /**< \brief [5:4] Load Jump Timer Run Status (rh) */
    unsigned int reserved_6 : 2;              /**< \brief \internal Reserved */
    unsigned int LJTOV : 1;                   /**< \brief [8:8] Load Jump Timer Overflow Status (rh) */
    unsigned int reserved_9 : 3;              /**< \brief \internal Reserved */
    unsigned int LJTOVCLR : 1;                /**< \brief [12:12] Load Jump Timer Overflow Status Clear (w) */
    unsigned int reserved_13 : 3;             /**< \brief \internal Reserved */
    unsigned int LJTCNT : 16;                 /**< \brief [31:16] Load Jump Timer Value (rh) */
} Ifx_SCU_PMTRCSR2_Bits;

/** \\brief  Power Management Transition Control and Status Register 3 */
typedef struct _Ifx_SCU_PMTRCSR3_Bits
{
    unsigned int VDROOPREQ : 2;               /**< \brief [1:0] Voltage Droop Request (rwh) */
    unsigned int reserved_2 : 2;              /**< \brief \internal Reserved */
    unsigned int VDTRUN : 2;                  /**< \brief [5:4] Voltage Droop Timer Run Status (rh) */
    unsigned int reserved_6 : 2;              /**< \brief \internal Reserved */
    unsigned int VDTOV : 1;                   /**< \brief [8:8] Voltage Droop Timer Overflow Status (rh) */
    unsigned int reserved_9 : 3;              /**< \brief \internal Reserved */
    unsigned int VDTOVCLR : 1;                /**< \brief [12:12] Voltage Droop Timer Overflow Status Clear (w) */
    unsigned int reserved_13 : 3;             /**< \brief \internal Reserved */
    unsigned int VDTCNT : 10;                 /**< \brief [25:16] Voltage Droop Timer Value (rh) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_SCU_PMTRCSR3_Bits;

/** \\brief  Additional Reset Control Register */
typedef struct _Ifx_SCU_RSTCON2_Bits
{
    unsigned int FRTO : 1;                    /**< \brief [0:0] Force Reset Timeout (rw) */
    unsigned int CLRC : 1;                    /**< \brief [1:1] Clear Cold Reset Status (w) */
    unsigned int TOUT20 : 1;                  /**< \brief [2:2] Reset Timeout Counter 20us (rh) */
    unsigned int TOUT40 : 1;                  /**< \brief [3:3] Reset Timeout Counter 40us (rh) */
    unsigned int TOUT60 : 1;                  /**< \brief [4:4] Reset Timeout Counter 60us (rh) */
    unsigned int TOUT80 : 1;                  /**< \brief [5:5] Reset Timeout Counter 80us (rh) */
    unsigned int FLSS : 1;                    /**< \brief [6:6] Flash Idle State Reached (rh) */
    unsigned int CSSx : 6;                    /**< \brief [12:7] CPU x Idle State Reached (rh) */
    unsigned int reserved_13 : 2;             /**< \brief \internal Reserved */
    unsigned int MCDSSS : 1;                  /**< \brief [15:15] MCDS Idle State Reached (rh) */
    unsigned int USRINFO : 16;                /**< \brief [31:16] User Information (rw) */
} Ifx_SCU_RSTCON2_Bits;

/** \\brief  Reset Configuration Register */
typedef struct _Ifx_SCU_RSTCON_Bits
{
    unsigned int ESR0 : 2;                    /**< \brief [1:0] ESR0 Reset Request Trigger Reset Configuration (rw) */
    unsigned int ESR1 : 2;                    /**< \brief [3:2] ESR1 Reset Request Trigger Reset Configuration (rw) */
    unsigned int reserved_4 : 2;              /**< \brief \internal Reserved */
    unsigned int SMU : 2;                     /**< \brief [7:6] SMU Reset Request Trigger Reset Configuration (rw) */
    unsigned int SW : 2;                      /**< \brief [9:8] SW Reset Request Trigger Reset Configuration (rw) */
    unsigned int STM0 : 2;                    /**< \brief [11:10] STM0 Reset Request Trigger Reset Configuration (rw) */
    unsigned int STM1 : 2;                    /**< \brief [13:12] STM1 Reset Request Trigger Reset Configuration (If Product has STM1) (rw) */
    unsigned int STM2 : 2;                    /**< \brief [15:14] STM2 Reset Request Trigger Reset Configuration (If Product has STM2) (rw) */
    unsigned int STM3 : 2;                    /**< \brief [17:16] STM3 Reset Request Trigger Reset Configuration (If Product has STM3) (rw) */
    unsigned int STM4 : 2;                    /**< \brief [19:18] STM4 Reset Request Trigger Reset Configuration (If Product has STM4) (rw) */
    unsigned int STM5 : 2;                    /**< \brief [21:20] STM5 Reset Request Trigger Reset Configuration (If Product has STM5) (rw) */
    unsigned int reserved_22 : 10;            /**< \brief \internal Reserved */
} Ifx_SCU_RSTCON_Bits;

/** \\brief  Reset Status Register */
typedef struct _Ifx_SCU_RSTSTAT_Bits
{
    unsigned int ESR0 : 1;                    /**< \brief [0:0] Reset Request Trigger Reset Status for ESR0 (rh) */
    unsigned int ESR1 : 1;                    /**< \brief [1:1] Reset Request Trigger Reset Status for ESR1 (rh) */
    unsigned int reserved_2 : 1;              /**< \brief \internal Reserved */
    unsigned int SMU : 1;                     /**< \brief [3:3] Reset Request Trigger Reset Status for SMU (rh) */
    unsigned int SW : 1;                      /**< \brief [4:4] Reset Request Trigger Reset Status for SW (rh) */
    unsigned int STM0 : 1;                    /**< \brief [5:5] Reset Request Trigger Reset Status for STM0 Compare Match (rh) */
    unsigned int STM1 : 1;                    /**< \brief [6:6] Reset Request Trigger Reset Status for STM1 Compare Match (If Product has STM1) (rh) */
    unsigned int STM2 : 1;                    /**< \brief [7:7] Reset Request Trigger Reset Status for STM2 Compare Match (If Product has STM2) (rh) */
    unsigned int STM3 : 1;                    /**< \brief [8:8] Reset Request Trigger Reset Status for STM3 Compare Match (If Product has STM3) (rh) */
    unsigned int STM4 : 1;                    /**< \brief [9:9] Reset Request Trigger Reset Status for STM4 Compare Match (If Product has STM4) (rh) */
    unsigned int STM5 : 1;                    /**< \brief [10:10] Reset Request Trigger Reset Status for STM5 Compare Match (If Product has STM5) (rh) */
    unsigned int reserved_11 : 5;             /**< \brief \internal Reserved */
    unsigned int PORST : 1;                   /**< \brief [16:16] Reset Request Trigger Reset Status for PORST (rh) */
    unsigned int reserved_17 : 1;             /**< \brief \internal Reserved */
    unsigned int CB0 : 1;                     /**< \brief [18:18] Reset Request Trigger Reset Status for Cerberus System Reset (rh) */
    unsigned int CB1 : 1;                     /**< \brief [19:19] Reset Request Trigger Reset Status for Cerberus Debug Reset (rh) */
    unsigned int CB3 : 1;                     /**< \brief [20:20] Reset Request Trigger Reset Status for Cerberus Application Reset (rh) */
    unsigned int TP : 1;                      /**< \brief [21:21] Reset Request Trigger Reset Status for Tuning Protection (rh) */
    unsigned int TCU : 1;                     /**< \brief [22:22] Reset Request Trigger Reset Status for TCU (rh) */
    unsigned int EVRC : 1;                    /**< \brief [23:23] Reset Request Trigger Reset Status for EVRC (rh) */
    unsigned int EVR33 : 1;                   /**< \brief [24:24] Reset Request Trigger Reset Status for EVR33 (rh) */
    unsigned int SWD : 1;                     /**< \brief [25:25] Reset Request Trigger Reset Status for Supply Watchdog (SWD) (rh) */
    unsigned int HSMS : 1;                    /**< \brief [26:26] Reset Request Trigger Reset Status for HSM System Reset (HSM S) (rh) */
    unsigned int HSMA : 1;                    /**< \brief [27:27] Reset Request Trigger Reset Status for HSM Application Reset (HSM A) (rh) */
    unsigned int STBYR : 1;                   /**< \brief [28:28] Reset Request Trigger Reset Status for Standby Regulator Watchdog (STBYR) (rh) */
    unsigned int RBBF0 : 1;                   /**< \brief [29:29] Reserved (r) */
    unsigned int RBBF1 : 1;                   /**< \brief [30:30] Reserved (r) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_SCU_RSTSTAT_Bits;

/** \\brief  Safety ENDINIT Control Register 0 */
typedef struct _Ifx_SCU_SEICON0_Bits
{
    unsigned int Reserved : 1;                /**< \brief [0:0] Reserved Bit (r) */
    unsigned int ENDINIT : 1;                 /**< \brief [1:1] End-of-Initialization Control Bit (rwh) */
    unsigned int EPW : 14;                    /**< \brief [15:2] User-Definable ENDINIT Password Field (rwh) */
    unsigned int REL : 16;                    /**< \brief [31:16] Reload Value for the ENDINIT timer (r) */
} Ifx_SCU_SEICON0_Bits;

/** \\brief  Safety ENDINIT Control Register 1 */
typedef struct _Ifx_SCU_SEICON1_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int IR0 : 1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR : 1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4 : 1;              /**< \brief \internal Reserved */
    unsigned int IR1 : 1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int reserved_6 : 26;             /**< \brief \internal Reserved */
} Ifx_SCU_SEICON1_Bits;

/** \\brief  Safety ENDINIT Timeout Status Register */
typedef struct _Ifx_SCU_SEISR_Bits
{
    unsigned int AE : 1;                      /**< \brief [0:0] SEICON0 Access Error Status Flag (rh) */
    unsigned int OE : 1;                      /**< \brief [1:1] EI Timeout Overflow Error Status Flag (rh) */
    unsigned int IS0 : 1;                     /**< \brief [2:2] EI Timeout Input Clock Status (rh) */
    unsigned int DS : 1;                      /**< \brief [3:3] Watchdog Enable/Disable Status Flag (rh) */
    unsigned int TO : 1;                      /**< \brief [4:4] Watchdog Time-Out Mode Flag (rh) */
    unsigned int IS1 : 1;                     /**< \brief [5:5] EI Timeout Input Clock Status (rh) */
    unsigned int reserved_6 : 10;             /**< \brief \internal Reserved */
    unsigned int TIM : 16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_SEISR_Bits;

/** \\brief  Start-up Status Register */
typedef struct _Ifx_SCU_STSTAT_Bits
{
    unsigned int HWCFG : 8;                   /**< \brief [7:0] Hardware Configuration Setting (rh) */
    unsigned int FTM : 7;                     /**< \brief [14:8] Firmware Test Setting (rh) */
    unsigned int MODE : 1;                    /**< \brief [15:15] MODE (rh) */
    unsigned int FCBAE : 1;                   /**< \brief [16:16] Flash Config. Sector Access Enable (rh) */
    unsigned int LUDIS : 1;                   /**< \brief [17:17] Latch Update Disable (rh) */
    unsigned int FARFUSE : 1;                 /**< \brief [18:18] FAR Fuse State (rh) */
    unsigned int TRSTL : 1;                   /**< \brief [19:19] TRSTL Status (rh) */
    unsigned int SPDEN : 1;                   /**< \brief [20:20] Single Pin DAP Mode Enable (rh) */
    unsigned int OTPOFF : 1;                  /**< \brief [21:21] OTP Over-ruled (rh) */
    unsigned int FSIOFF : 1;                  /**< \brief [22:22] FSI Disabled (rh) */
    unsigned int STPOVREQ : 1;                /**< \brief [23:23] Start-Up Protection Over-ruling Request (rh) */
    unsigned int RAMINT : 1;                  /**< \brief [24:24] RAM Content Security Integrity (rh) */
    unsigned int reserved_25 : 3;             /**< \brief \internal Reserved */
    unsigned int SUBFUSE : 4;                 /**< \brief [31:28] Individual FAR Fuse State (rh) */
} Ifx_SCU_STSTAT_Bits;

