Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Software Reset Configuration Register */
typedef struct _Ifx_SCU_SWRSTCON_Bits
{
    unsigned int SWBOOT : 1;                  /**< \brief [0:0] Software Boot Configuration Selection (rw) */
    unsigned int SWRSTREQ : 1;                /**< \brief [1:1] Software Reset Request (w) */
    unsigned int reserved_2 : 6;              /**< \brief \internal Reserved */
    unsigned int SWCFG : 8;                   /**< \brief [15:8] Software Boot Configuration (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_SWRSTCON_Bits;

/** \\brief  System Control Register */
typedef struct _Ifx_SCU_SYSCON_Bits
{
    unsigned int CCTRIG0 : 1;                 /**< \brief [0:0] Capture Compare Trigger 0 (rw) */
    unsigned int reserved_1 : 1;              /**< \brief \internal Reserved */
    unsigned int RAMINTM : 2;                 /**< \brief [3:2] RAM Integrity Modify (w) */
    unsigned int SETLUDIS : 1;                /**< \brief [4:4] Set Latch Update Disable (w) */
    unsigned int reserved_5 : 3;              /**< \brief \internal Reserved */
    unsigned int DDC : 1;                     /**< \brief [8:8] Disable DXCPL (rw) */
    unsigned int reserved_9 : 23;             /**< \brief \internal Reserved */
} Ifx_SCU_SYSCON_Bits;

/** \\brief  System PLL Configuration 0 Register */
typedef struct _Ifx_SCU_SYSPLLCON0_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int MODEN : 1;                   /**< \brief [2:2] Modulation Enable (rw) */
    unsigned int reserved_3 : 6;              /**< \brief \internal Reserved */
    unsigned int NDIV : 7;                    /**< \brief [15:9] N-Divider Value (rw) */
    unsigned int PLLPWD : 1;                  /**< \brief [16:16] System PLL Power Saving Mode (rw) */
    unsigned int reserved_17 : 1;             /**< \brief \internal Reserved */
    unsigned int RESLD : 1;                   /**< \brief [18:18] Restart DCO Lock Detection (w) */
    unsigned int reserved_19 : 5;             /**< \brief \internal Reserved */
    unsigned int PDIV : 3;                    /**< \brief [26:24] P-Divider Value (rw) */
    unsigned int reserved_27 : 3;             /**< \brief \internal Reserved */
    unsigned int INSEL : 2;                   /**< \brief [31:30] Input Selection (rw) */
} Ifx_SCU_SYSPLLCON0_Bits;

/** \\brief  System PLL Configuration 1 Register */
typedef struct _Ifx_SCU_SYSPLLCON1_Bits
{
    unsigned int K2DIV : 3;                   /**< \brief [2:0] K2-Divider Value (rw) */
    unsigned int reserved_3 : 29;             /**< \brief \internal Reserved */
} Ifx_SCU_SYSPLLCON1_Bits;

/** \\brief  System PLL Configuration 2 Register */
typedef struct _Ifx_SCU_SYSPLLCON2_Bits
{
    unsigned int MODCFG : 16;                 /**< \brief [15:0] Modulation Configuration (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_SYSPLLCON2_Bits;

/** \\brief  System PLL Status Register */
typedef struct _Ifx_SCU_SYSPLLSTAT_Bits
{
    unsigned int reserved_0 : 1;              /**< \brief \internal Reserved */
    unsigned int PWDSTAT : 1;                 /**< \brief [1:1] System PLL Power-saving Mode Status (rh) */
    unsigned int LOCK : 1;                    /**< \brief [2:2] System PLL Lock Status (rh) */
    unsigned int reserved_3 : 2;              /**< \brief \internal Reserved */
    unsigned int K2RDY : 1;                   /**< \brief [5:5] K2 Divider Ready Status (rh) */
    unsigned int BY : 1;                      /**< \brief [6:6] Bypass Mode Status (rh) */
    unsigned int MODRUN : 1;                  /**< \brief [7:7] Modulation Run (rh) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_SCU_SYSPLLSTAT_Bits;

/** \\brief  Trap Clear Register */
typedef struct _Ifx_SCU_TRAPCLR_Bits
{
    unsigned int ESR0T : 1;                   /**< \brief [0:0] Clear Trap Request Flag ESR0T (w) */
    unsigned int ESR1T : 1;                   /**< \brief [1:1] Clear Trap Request Flag ESR1T (w) */
    unsigned int TRAP2 : 1;                   /**< \brief [2:2] Clear Trap Request Flag TRAP2 (w) */
    unsigned int SMUT : 1;                    /**< \brief [3:3] Clear Trap Request Flag SMUT (w) */
    unsigned int reserved_4 : 28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPCLR_Bits;

/** \\brief  Trap Disable Register 0 */
typedef struct _Ifx_SCU_TRAPDIS0_Bits
{
    unsigned int CPU0ESR0T : 1;               /**< \brief [0:0] Disable Trap Request ESR0T on CPU0 (rw) */
    unsigned int CPU0ESR1T : 1;               /**< \brief [1:1] Disable Trap Request ESR1T on CPU0 (rw) */
    unsigned int CPU0TRAP2T : 1;              /**< \brief [2:2] Disable Trap Request TRAP2T on CPU0 (rw) */
    unsigned int CPU0SMUT : 1;                /**< \brief [3:3] Disable Trap Request SMUT on CPU0 (rw) */
    unsigned int reserved_4 : 4;              /**< \brief \internal Reserved */
    unsigned int CPU1ESR0T : 1;               /**< \brief [8:8] Disable Trap Request ESR0T on CPU1 (If product has CPU1) (rw) */
    unsigned int CPU1ESR1T : 1;               /**< \brief [9:9] Disable Trap Request ESR1T on CPU1 (If product has CPU1) (rw) */
    unsigned int CPU1TRAP2T : 1;              /**< \brief [10:10] Disable Trap Request TRAP2T on CPU1 (If product has CPU1) (rw) */
    unsigned int CPU1SMUT : 1;                /**< \brief [11:11] Disable Trap Request SMUT on CPU1 (If product has CPU1) (rw) */
    unsigned int reserved_12 : 4;             /**< \brief \internal Reserved */
    unsigned int CPU2ESR0T : 1;               /**< \brief [16:16] Disable Trap Request ESR0T on CPU2 (If product has CPU2) (rw) */
    unsigned int CPU2ESR1T : 1;               /**< \brief [17:17] Disable Trap Request ESR1T on CPU2 (If product has CPU2) (rw) */
    unsigned int CPU2TRAP2T : 1;              /**< \brief [18:18] Disable Trap Request TRAP2T on CPU2 (If product has CPU2) (rw) */
    unsigned int CPU2SMUT : 1;                /**< \brief [19:19] Disable Trap Request SMUT on CPU2 (If product has CPU2) (rw) */
    unsigned int reserved_20 : 4;             /**< \brief \internal Reserved */
    unsigned int CPU3ESR0T : 1;               /**< \brief [24:24] Disable Trap Request ESR0T on CPU3 (If product has CPU3) (rw) */
    unsigned int CPU3ESR1T : 1;               /**< \brief [25:25] Disable Trap Request ESR1T on CPU3 (If product has CPU3) (rw) */
    unsigned int CPU3TRAP2T : 1;              /**< \brief [26:26] Disable Trap Request TRAP2T on CPU3 (If product has CPU3) (rw) */
    unsigned int CPU3SMUT : 1;                /**< \brief [27:27] Disable Trap Request SMUT on CPU3 (If product has CPU3) (rw) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPDIS0_Bits;

