Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Trap Disable Register 1 */
typedef struct _Ifx_SCU_TRAPDIS1_Bits
{
    unsigned int CPU4ESR0T : 1;               /**< \brief [0:0] Disable Trap Request ESR0T on CPU4 (If product has CPU4) (rw) */
    unsigned int CPU4ESR1T : 1;               /**< \brief [1:1] Disable Trap Request ESR1T on CPU4 (If product has CPU4) (rw) */
    unsigned int CPU4TRAP2T : 1;              /**< \brief [2:2] Disable Trap Request TRAP2T on CPU4 (If product has CPU4) (rw) */
    unsigned int CPU4SMUT : 1;                /**< \brief [3:3] Disable Trap Request SMUT on CPU4 (If product has CPU4) (rw) */
    unsigned int reserved_4 : 4;              /**< \brief \internal Reserved */
    unsigned int CPU5ESR0T : 1;               /**< \brief [8:8] Disable Trap Request ESR0T on CPU5 (If product has CPU5) (rw) */
    unsigned int CPU5ESR1T : 1;               /**< \brief [9:9] Disable Trap Request ESR1T on CPU5 (If product has CPU5) (rw) */
    unsigned int CPU5TRAP2T : 1;              /**< \brief [10:10] Disable Trap Request TRAP2T on CPU5 (If product has CPU5) (rw) */
    unsigned int CPU5SMUT : 1;                /**< \brief [11:11] Disable Trap Request SMUT on CPU5 (If product has CPU5) (rw) */
    unsigned int reserved_12 : 20;            /**< \brief \internal Reserved */
} Ifx_SCU_TRAPDIS1_Bits;

/** \\brief  Trap Set Register */
typedef struct _Ifx_SCU_TRAPSET_Bits
{
    unsigned int ESR0T : 1;                   /**< \brief [0:0] Set Trap Request Flag ESR0T (w) */
    unsigned int ESR1T : 1;                   /**< \brief [1:1] Set Trap Request Flag ESR1T (w) */
    unsigned int TRAP2 : 1;                   /**< \brief [2:2] Set Trap Request Flag TRAP2 (w) */
    unsigned int SMUT : 1;                    /**< \brief [3:3] Set Trap Request Flag SMUT (w) */
    unsigned int reserved_4 : 28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPSET_Bits;

/** \\brief  Trap Status Register */
typedef struct _Ifx_SCU_TRAPSTAT_Bits
{
    unsigned int ESR0T : 1;                   /**< \brief [0:0] ESR0 Trap Request Flag (rh) */
    unsigned int ESR1T : 1;                   /**< \brief [1:1] ESR1 Trap Request Flag (rh) */
    unsigned int TRAP2 : 1;                   /**< \brief [2:2] Trap Bit 2 Request Flag (rh) */
    unsigned int SMUT : 1;                    /**< \brief [3:3] SMU Alarm Trap Request Flag (rh) */
    unsigned int reserved_4 : 28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPSTAT_Bits;

/** \\brief  CPU WDT Control Register 0 */
typedef struct _Ifx_SCU_WDTCPU_CON0_Bits
{
    Ifx_Strict_32Bit ENDINIT : 1;                 /**< \brief [0:0] End-of-Initialization Control Bit (rwh) */
    Ifx_Strict_32Bit LCK : 1;                     /**< \brief [1:1] Lock Bit to Control Access to WDTxCON0 (rwh) */
    Ifx_Strict_32Bit PW : 14;                     /**< \brief [15:2] User-Definable Password Field for Access to WDTxCON0 (rwh) */
    Ifx_Strict_32Bit REL : 16;                    /**< \brief [31:16] Reload Value for the WDT (also Time Check Value) (rw) */
} Ifx_SCU_WDTCPU_CON0_Bits;

/** \\brief  CPU WDT Control Register 1 */
typedef struct _Ifx_SCU_WDTCPU_CON1_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int IR0 : 1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR : 1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4 : 1;              /**< \brief \internal Reserved */
    unsigned int IR1 : 1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int UR : 1;                      /**< \brief [6:6] Unlock Restriction Request Control Bit (rw) */
    unsigned int PAR : 1;                     /**< \brief [7:7] Password Auto-sequence Request Bit (rw) */
    unsigned int TCR : 1;                     /**< \brief [8:8] Counter Check Request Bit (rw) */
    unsigned int TCTR : 7;                    /**< \brief [15:9] Timer Check Tolerance Request (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_WDTCPU_CON1_Bits;

/** \\brief  CPU WDT Status Register */
typedef struct _Ifx_SCU_WDTCPU_SR_Bits
{
    unsigned int AE : 1;                      /**< \brief [0:0] Watchdog Access Error Status Flag (rh) */
    unsigned int OE : 1;                      /**< \brief [1:1] Watchdog Overflow Error Status Flag (rh) */
    unsigned int IS0 : 1;                     /**< \brief [2:2] Watchdog Input Clock Status (rh) */
    unsigned int DS : 1;                      /**< \brief [3:3] Watchdog Enable/Disable Status Flag (rh) */
    unsigned int TO : 1;                      /**< \brief [4:4] Watchdog Time-Out Mode Flag (rh) */
    unsigned int IS1 : 1;                     /**< \brief [5:5] Watchdog Input Clock Status (rh) */
    unsigned int US : 1;                      /**< \brief [6:6] SMU Unlock Restriction Status Flag (rh) */
    unsigned int PAS : 1;                     /**< \brief [7:7] Password Auto-sequence Status Flag (rh) */
    unsigned int TCS : 1;                     /**< \brief [8:8] Timer Check Status Flag (rh) */
    unsigned int TCT : 7;                     /**< \brief [15:9] Timer Check Tolerance (rh) */
    unsigned int TIM : 16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_WDTCPU_SR_Bits;

/** \\brief  System WDT Control Register 0 */
typedef struct _Ifx_SCU_WDTS_CON0_Bits
{
    Ifx_Strict_32Bit ENDINIT : 1;                 /**< \brief [0:0] End-of-Initialization Control Bit (rwh) */
    Ifx_Strict_32Bit LCK : 1;                     /**< \brief [1:1] Lock Bit to Control Access to WDTxCON0 (rwh) */
    Ifx_Strict_32Bit PW : 14;                     /**< \brief [15:2] User-Definable Password Field for Access to WDTxCON0 (rwh) */
    Ifx_Strict_32Bit REL : 16;                    /**< \brief [31:16] Reload Value for the WDT (also Time Check Value) (rw) */
} Ifx_SCU_WDTS_CON0_Bits;

/** \\brief  System WDT Control Register 1 */
typedef struct _Ifx_SCU_WDTS_CON1_Bits
{
    unsigned int CLRIRF : 1;                  /**< \brief [0:0] Clear Internal Reset Flag (rwh) */
    unsigned int reserved_1 : 1;              /**< \brief \internal Reserved */
    unsigned int IR0 : 1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR : 1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4 : 1;              /**< \brief \internal Reserved */
    unsigned int IR1 : 1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int UR : 1;                      /**< \brief [6:6] Unlock Restriction Request Control Bit (rw) */
    unsigned int PAR : 1;                     /**< \brief [7:7] Password Auto-sequence Request Bit (rw) */
    unsigned int TCR : 1;                     /**< \brief [8:8] Counter Check Request Bit (rw) */
    unsigned int TCTR : 7;                    /**< \brief [15:9] Timer Check Tolerance Request (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_SCU_WDTS_CON1_Bits;

/** \\brief  System WDT Status Register */
typedef struct _Ifx_SCU_WDTS_SR_Bits
{
    unsigned int AE : 1;                      /**< \brief [0:0] Watchdog Access Error Status Flag (rh) */
    unsigned int OE : 1;                      /**< \brief [1:1] Watchdog Overflow Error Status Flag (rh) */
    unsigned int IS0 : 1;                     /**< \brief [2:2] Watchdog Input Clock Status (rh) */
    unsigned int DS : 1;                      /**< \brief [3:3] Watchdog Enable/Disable Status Flag (rh) */
    unsigned int TO : 1;                      /**< \brief [4:4] Watchdog Time-Out Mode Flag (rh) */
    unsigned int IS1 : 1;                     /**< \brief [5:5] Watchdog Input Clock Status (rh) */
    unsigned int US : 1;                      /**< \brief [6:6] SMU Unlock Restriction Status Flag (rh) */
    unsigned int PAS : 1;                     /**< \brief [7:7] Password Auto-sequence Status Flag (rh) */
    unsigned int TCS : 1;                     /**< \brief [8:8] Timer Check Status Flag (rh) */
    unsigned int TCT : 7;                     /**< \brief [15:9] Timer Check Tolerance (rh) */
    unsigned int TIM : 16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_WDTS_SR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_union
 * \{  */

/** \\brief  Access Enable Register 00 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN00_Bits B;
} Ifx_SCU_ACCEN00;

/** \\brief  Access Enable Register 01 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN01_Bits B;
} Ifx_SCU_ACCEN01;

/** \\brief  Access Enable Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN10_Bits B;
} Ifx_SCU_ACCEN10;

/** \\brief  Access Enable Register 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN11_Bits B;
} Ifx_SCU_ACCEN11;

/** \\brief  Application Reset Disable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_ARSTDIS_Bits B;
} Ifx_SCU_ARSTDIS;

/** \\brief  CCU Clock Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON0_Bits B;
} Ifx_SCU_CCUCON0;

/** \\brief  CCU Clock Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON1_Bits B;
} Ifx_SCU_CCUCON1;

/** \\brief  CCU Clock Control Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON10_Bits B;
} Ifx_SCU_CCUCON10;

/** \\brief  CCU Clock Control Register 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON11_Bits B;
} Ifx_SCU_CCUCON11;

