Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxScu_regdef.h
/** \\brief  Software Reset Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_SWRSTCON_Bits B;
} Ifx_SCU_SWRSTCON;

/** \\brief  System Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSCON_Bits B;
} Ifx_SCU_SYSCON;

/** \\brief  System PLL Configuration 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSPLLCON0_Bits B;
} Ifx_SCU_SYSPLLCON0;

/** \\brief  System PLL Configuration 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSPLLCON1_Bits B;
} Ifx_SCU_SYSPLLCON1;

/** \\brief  System PLL Configuration 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSPLLCON2_Bits B;
} Ifx_SCU_SYSPLLCON2;

/** \\brief  System PLL Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int            U;
    /** \brief Signed access */
    signed int              I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSPLLSTAT_Bits B;
} Ifx_SCU_SYSPLLSTAT;

/** \\brief  Trap Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPCLR_Bits B;
} Ifx_SCU_TRAPCLR;

/** \\brief  Trap Disable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPDIS0_Bits B;
} Ifx_SCU_TRAPDIS0;

/** \\brief  Trap Disable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPDIS1_Bits B;
} Ifx_SCU_TRAPDIS1;

/** \\brief  Trap Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPSET_Bits B;
} Ifx_SCU_TRAPSET;

/** \\brief  Trap Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int          U;
    /** \brief Signed access */
    signed int            I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPSTAT_Bits B;
} Ifx_SCU_TRAPSTAT;

/** \\brief  CPU WDT Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_CON0_Bits B;
} Ifx_SCU_WDTCPU_CON0;

/** \\brief  CPU WDT Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int             U;
    /** \brief Signed access */
    signed int               I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_CON1_Bits B;
} Ifx_SCU_WDTCPU_CON1;

/** \\brief  CPU WDT Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_SR_Bits B;
} Ifx_SCU_WDTCPU_SR;

/** \\brief  System WDT Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_CON0_Bits B;
} Ifx_SCU_WDTS_CON0;

/** \\brief  System WDT Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_CON1_Bits B;
} Ifx_SCU_WDTS_CON1;

/** \\brief  System WDT Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_SR_Bits B;
} Ifx_SCU_WDTS_SR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  CPU watchdog */
typedef volatile struct _Ifx_SCU_WDTCPU
{
    Ifx_SCU_WDTCPU_CON0 CON0;               /**< \brief 0, CPU WDT Control Register 0 */
    Ifx_SCU_WDTCPU_CON1 CON1;               /**< \brief 4, CPU WDT Control Register 1 */
    Ifx_SCU_WDTCPU_SR   SR;                 /**< \brief 8, CPU WDT Status Register */
} Ifx_SCU_WDTCPU;

/** \\brief  Safety watchdog */
typedef volatile struct _Ifx_SCU_WDTS
{
    Ifx_SCU_WDTS_CON0 CON0;                 /**< \brief 0, System WDT Control Register 0 */
    Ifx_SCU_WDTS_CON1 CON1;                 /**< \brief 4, System WDT Control Register 1 */
    Ifx_SCU_WDTS_SR   SR;                   /**< \brief 8, System WDT Status Register */
} Ifx_SCU_WDTS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SCU object */
typedef volatile struct _Ifx_SCU
{
    unsigned char       reserved_0[8];      /**< \brief 0, \internal Reserved */
    Ifx_SCU_ID          ID;                 /**< \brief 8, Identification Register */
    unsigned char       reserved_C[4];      /**< \brief C, \internal Reserved */
    Ifx_SCU_OSCCON      OSCCON;             /**< \brief 10, OSC Control Register */
    Ifx_SCU_SYSPLLSTAT  SYSPLLSTAT;         /**< \brief 14, System PLL Status Register */
    Ifx_SCU_SYSPLLCON0  SYSPLLCON0;         /**< \brief 18, System PLL Configuration 0 Register */
    Ifx_SCU_SYSPLLCON1  SYSPLLCON1;         /**< \brief 1C, System PLL Configuration 1 Register */
    Ifx_SCU_SYSPLLCON2  SYSPLLCON2;         /**< \brief 20, System PLL Configuration 2 Register */
    Ifx_SCU_PERPLLSTAT  PERPLLSTAT;         /**< \brief 24, Peripheral PLL Status Register */
    Ifx_SCU_PERPLLCON0  PERPLLCON0;         /**< \brief 28, Peripheral PLL Configuration 0 Register */
    Ifx_SCU_PERPLLCON1  PERPLLCON1;         /**< \brief 2C, Peripheral PLL Configuration 1 Register */
    Ifx_SCU_CCUCON0     CCUCON0;            /**< \brief 30, CCU Clock Control Register 0 */
    Ifx_SCU_CCUCON1     CCUCON1;            /**< \brief 34, CCU Clock Control Register 1 */
    Ifx_SCU_FDR         FDR;                /**< \brief 38, Fractional Divider Register */
    Ifx_SCU_EXTCON      EXTCON;             /**< \brief 3C, External Clock Control Register */
    Ifx_SCU_CCUCON2     CCUCON2;            /**< \brief 40, CCU Clock Control Register 2 */
    unsigned char       reserved_44[4];     /**< \brief 44, \internal Reserved */
    unsigned char       reserved_48[4];     /**< \brief 48, \internal Reserved */
    unsigned char       reserved_4C[4];     /**< \brief 4C, \internal Reserved */
    Ifx_SCU_RSTSTAT     RSTSTAT;            /**< \brief 50, Reset Status Register */
    unsigned char       reserved_54[4];     /**< \brief 54, \internal Reserved */
    Ifx_SCU_RSTCON      RSTCON;             /**< \brief 58, Reset Configuration Register */
    Ifx_SCU_ARSTDIS     ARSTDIS;            /**< \brief 5C, Application Reset Disable Register */
    Ifx_SCU_SWRSTCON    SWRSTCON;           /**< \brief 60, Software Reset Configuration Register */
    Ifx_SCU_RSTCON2     RSTCON2;            /**< \brief 64, Additional Reset Control Register */
    unsigned char       reserved_68[8];     /**< \brief 68, \internal Reserved */
    Ifx_SCU_ESRCFG      ESRCFG[2];          /**< \brief 70, ESR Input Configuration Register */
    Ifx_SCU_ESROCFG     ESROCFG;            /**< \brief 78, ESR Output Configuration Register */
    Ifx_SCU_SYSCON      SYSCON;             /**< \brief 7C, System Control Register */
    Ifx_SCU_CCUCON6     CCUCON6;            /**< \brief 80, CCU Clock Control Register 6 */
    Ifx_SCU_CCUCON7     CCUCON7;            /**< \brief 84, CCU Clock Control Register 7 */
    Ifx_SCU_CCUCON8     CCUCON8;            /**< \brief 88, CCU Clock Control Register 8 */
    Ifx_SCU_CCUCON9     CCUCON9;            /**< \brief 8C, CCU Clock Control Register 9 */
    Ifx_SCU_CCUCON10    CCUCON10;           /**< \brief 90, CCU Clock Control Register 10 */
    Ifx_SCU_CCUCON11    CCUCON11;           /**< \brief 94, CCU Clock Control Register 11 */
    unsigned char       reserved_98[4];     /**< \brief 98, \internal Reserved */
    Ifx_SCU_PDR         PDR;                /**< \brief 9C, ESR Pad Driver Mode Register */
    Ifx_SCU_IOCR        IOCR;               /**< \brief A0, Input/Output Control Register */
    Ifx_SCU_OUT         OUT;                /**< \brief A4, ESR Output Register */
    Ifx_SCU_OMR         OMR;                /**< \brief A8, ESR Output Modification Register */
    Ifx_SCU_IN          IN;                 /**< \brief AC, ESR Input Register */
    unsigned char       reserved_B0[8];     /**< \brief B0, \internal Reserved */
    Ifx_SCU_MODTRIMCON1 MODTRIMCON1;        /**< \brief B8, Modulation Trim 1 Configuration Register */
    unsigned char       reserved_BC[4];     /**< \brief BC, \internal Reserved */
    Ifx_SCU_STSTAT      STSTAT;             /**< \brief C0, Start-up Status Register */
    unsigned char       reserved_C4[4];     /**< \brief C4, \internal Reserved */
    Ifx_SCU_PMCSR       PMCSR[6];           /**< \brief C8, Power Management Control and Status Register \note Array index shifted by 3. Example: defined register PMCSR[0]/PMCSR0 corresponds to user manual PMCSR3, ... */
    unsigned char       reserved_E0[4];     /**< \brief E0, \internal Reserved */
    Ifx_SCU_PMSTAT0     PMSTAT0;            /**< \brief E4, Power Management Status Register 0 */
    Ifx_SCU_PMSWCR1     PMSWCR1;            /**< \brief E8, Standby and Wake-up Control Register 1 */
    unsigned char       reserved_EC[16];    /**< \brief EC, \internal Reserved */
    Ifx_SCU_EMSR        EMSR;               /**< \brief FC, Emergency Stop Register */
    unsigned char       reserved_100[32];   /**< \brief 100, \internal Reserved */
    Ifx_SCU_TRAPDIS1    TRAPDIS1;           /**< \brief 120, Trap Disable Register 1 */
    Ifx_SCU_TRAPSTAT    TRAPSTAT;           /**< \brief 124, Trap Status Register */
    Ifx_SCU_TRAPSET     TRAPSET;            /**< \brief 128, Trap Set Register */
    Ifx_SCU_TRAPCLR     TRAPCLR;            /**< \brief 12C, Trap Clear Register */
    Ifx_SCU_TRAPDIS0    TRAPDIS0;           /**< \brief 130, Trap Disable Register 0 */
    Ifx_SCU_LCLCON0     LCLCON0;            /**< \brief 134, LCL CPU0 Control Register */
    Ifx_SCU_LCLCON1     LCLCON1;            /**< \brief 138, LCL CPU1 Control Register */
    Ifx_SCU_LCLTEST     LCLTEST;            /**< \brief 13C, LCL Test Register */
    Ifx_SCU_CHIPID      CHIPID;             /**< \brief 140, Chip Identification Register */
    Ifx_SCU_MANID       MANID;              /**< \brief 144, Manufacturer Identification Register */
    unsigned char       reserved_148[4];    /**< \brief 148, \internal Reserved */
    unsigned char       reserved_14C[12];   /**< \brief 14C, \internal Reserved */
    unsigned char       reserved_158[12];   /**< \brief 158, \internal Reserved */
    Ifx_SCU_LBISTCTRL0  LBISTCTRL0;         /**< \brief 164, Logic BIST Control 0 Register */
    Ifx_SCU_LBISTCTRL1  LBISTCTRL1;         /**< \brief 168, Logic BIST Control 1 Register */
    Ifx_SCU_LBISTCTRL2  LBISTCTRL2;         /**< \brief 16C, Logic BIST Control 2 Register */
    Ifx_SCU_LBISTCTRL3  LBISTCTRL3;         /**< \brief 170, Logic BIST Control 3 Register */
    unsigned char       reserved_174[12];   /**< \brief 174, \internal Reserved */
    unsigned char       reserved_180[12];   /**< \brief 180, \internal Reserved  */
    Ifx_SCU_PDISC       PDISC;              /**< \brief 18C, Pad Disable Control Register */
    unsigned char       reserved_190[4];    /**< \brief 190, \internal Reserved  */
    unsigned char       reserved_194[4];    /**< \brief 194, \internal Reserved */
    Ifx_SCU_PMTRCSR0    PMTRCSR0;           /**< \brief 198, Power Management Transition Control and Status Register 0 */
    Ifx_SCU_PMTRCSR1    PMTRCSR1;           /**< \brief 19C, Power Management Transition Control and Status Register 1 */
    Ifx_SCU_PMTRCSR2    PMTRCSR2;           /**< \brief 1A0, Power Management Transition Control and Status Register 2 */
    Ifx_SCU_PMTRCSR3    PMTRCSR3;           /**< \brief 1A4, Power Management Transition Control and Status Register 3 */
    unsigned char       reserved_1A8[16];   /**< \brief 1A8, \internal Reserved */
    unsigned char       reserved_1B8[40];   /**< \brief 1B8, \internal Reserved */
    Ifx_SCU_OVCENABLE   OVCENABLE;          /**< \brief 1E0, Overlay Enable Register */
    Ifx_SCU_OVCCON      OVCCON;             /**< \brief 1E4, Overlay Control Register */
    unsigned char       reserved_1E8[32];   /**< \brief 1E8, \internal Reserved */
    unsigned char       reserved_208[4];    /**< \brief 208, \internal Reserved */
    Ifx_SCU_EIFILT      EIFILT;             /**< \brief 20C, External Input Filter Register */
    Ifx_SCU_EICR        EICR[4];            /**< \brief 210, External Input Channel Register  */
    Ifx_SCU_EIFR        EIFR;               /**< \brief 220, External Input Flag Register */
    Ifx_SCU_FMR         FMR;                /**< \brief 224, Flag Modification Register */
    Ifx_SCU_PDRR        PDRR;               /**< \brief 228, Pattern Detection Result Register */
    Ifx_SCU_IGCR        IGCR[4];            /**< \brief 22C, Flag Gating Register  */
    unsigned char       reserved_23C[16];   /**< \brief 23C, \internal Reserved */
    Ifx_SCU_WDTCPU      WDTCPU[6];          /**< \brief 24C, CPU watchdogs */
    unsigned char       reserved_294[8];    /**< \brief 294, \internal Reserved */
    Ifx_SCU_EICON0      EICON0;             /**< \brief 29C, ENDINIT Global Control Register 0 */
    Ifx_SCU_EICON1      EICON1;             /**< \brief 2A0, ENDINIT Global Control Register 1 */
    Ifx_SCU_EISR        EISR;               /**< \brief 2A4, ENDINIT Timeout Counter Status Register */
    Ifx_SCU_WDTS        WDTS;               /**< \brief 2A8, Safety watchdog */
    Ifx_SCU_SEICON0     SEICON0;            /**< \brief 2B4, Safety ENDINIT Control Register 0 */
    Ifx_SCU_SEICON1     SEICON1;            /**< \brief 2B8, Safety ENDINIT Control Register 1 */
    Ifx_SCU_SEISR       SEISR;              /**< \brief 2BC, Safety ENDINIT Timeout Status Register */
    unsigned char       reserved_2C0[24];   /**< \brief 2C0, \internal Reserved  */
    unsigned char       reserved_2DC[276];  /**< \brief 2DC, \internal Reserved */
    Ifx_SCU_ACCEN11     ACCEN11;            /**< \brief 3F0, Access Enable Register 11 */
    Ifx_SCU_ACCEN10     ACCEN10;            /**< \brief 3F4, Access Enable Register 10 */
    Ifx_SCU_ACCEN01     ACCEN01;            /**< \brief 3F8, Access Enable Register 01 */
    Ifx_SCU_ACCEN00     ACCEN00;            /**< \brief 3FC, Access Enable Register 00 */
} Ifx_SCU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSCU_REGDEF_H */
